B3/app/controllers/comments_controller.rb

  def create
  	@post = Post.find(params[:id])
  	@comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("author", "content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "12"], ["content", "1223"], ["post_id", 2], ["created_at", "2017-09-04 16:26:00.051904"], ["updated_at", "2017-09-04 16:26:00.051904"]]

  def destroy
  	@comment = Comment.find(params[:id])
  	@post = @comment.post
  	@comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]