B3/app/controllers/feedbacks_controller.rb

INSERT INTO "feedbacks" ("author", "content", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "1111"], ["content", "yegduysaje"], ["email", "123@hhu.com"], ["created_at", "2017-09-05 16:06:25.015433"], ["updated_at", "2017-09-05 16:06:25.015433"]]
---
  def create
    if request.post?
      name = params[:feedback][:author]
      email = params[:feedback][:email]
      content = params[:feedback][:content]
      feedback = Feedback.new(author: name, email: email, content: content)
      if feedback.save

SELECT "feedbacks".* FROM "feedbacks"
---
  def check
    @feedbacks = Feedback.all