B3/app/controllers/posts_controller.rb

  def index
    @posts=Post.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def admin_index
  	@posts=Post.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def create
    @post = Post.new(post_params)
    @post.user_id = session[:user_id]
    if @post.save
---
INSERT INTO "posts" ("title", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "1232waqE"], ["text", "13244444444444444444"], ["user_id", 1], ["created_at", "2017-09-04 16:20:50.025613"], ["updated_at", "2017-09-04 16:20:50.025613"]]

  def update
    @post = Post.find(params[:post][:id])
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["text", "13244444444447878"], ["updated_at", "2017-09-04 16:21:06.793459"], ["id", 1]]

  def destroy
    post = Post.find(params[:id])
    post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]