B3/app/controllers/users_controller.rb

  def login
    if logged_in?
      redirect_to admin_posts_path
      return
    end
    # 只有 POST 访问时，才对用户进行认证
    if request.post?
      name = params[:user][:name]
      password = params[:user][:password]
      user = User.find_by(name: name)
      # 用户可以使用用户名或者邮箱登录
      if !user
        user = User.find_by(email: name)
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "hhh"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "hhh"], ["LIMIT", 1]]

  def show
    @user = User.first
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def update
    @user = User.find(params[:user][:id])
    user_params = params.require(:user).permit(:name, :email, :password)
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$kod.Z5jkAewk3sdvqgvGPeP6073UCV6OvXkQRA8kF7.vkEvIZyJXG"], ["updated_at", "2017-09-05 07:55:34.664135"], ["id", 1]]

  def signup
  	if request.post?
  	  name = params[:user][:name]
  	  email = params[:user][:email]
      password = params[:user][:password]
  	  user = User.new(name: name, email: email, password: password)
  	  if user != nil
	    #if User.find_by(email: params[:user][:email])
	    user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)